fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусковНов/ВКМ_ГрафикОтпусковНов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусковНов</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиОтпусков/ВКМ_ГрафикиОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиОтпусков</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусковНов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
    
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
    Для каждого Строка Из ОтпускаСотрудников Цикл   
        
        Если ЗначениеЗаполнено (Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда 
            Если Строка.ДатаНачала > Строка.ДатаОкончания Тогда  
                ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Неверно заполнен период в строке №%1", Строка.НомерСтроки)); 
                Отказ = Истина; 
            КонецЕсли; 
        КонецЕсли; 
       
    КонецЦикла;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Набор = РегистрыСведений.ВКМ_ГрафикиОтпусков.СоздатьНаборЗаписей(); 
	Сутки = 60*60*24; 
	
	Для каждого Строка Из ОтпускаСотрудников Цикл
	    ДеньПлан = Строка.ДатаНачала; 
		Пока ДеньПлан < Строка.ДатаОкончания +1 Цикл
		   НоваяЗапись = Набор.Добавить(); 
		   НоваяЗапись.Дата = ДеньПлан; 
		   НоваяЗапись.Сотрудник = Строка.Сотрудник; 
		   НоваяЗапись.Значение = 1; 
		   ДеньПлан = ДеньПлан + Сутки; 
		КонецЦикла;
	КонецЦикла;    
	
	Набор.Записать(); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
